app/controllers/users_controller.rb

  def index
    # @users = User.all
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_digest" = '$2a$10$Xa15uJcwoOrbK5Bci9qmtutlWJ1rWXOD2SHlecPq8zG8AlQkkR2qm', "remember_token" = 'U612483XkzAQUgaUJwMeJw', "updated_at" = '2012-07-26 21:26:09.909782' WHERE "users"."id" = 1